Процедура ЗапретитьИзменениеЗакрытогоДокумента(Объект, ТолькоПросмотр) Экспорт
	Если Не Объект.Ссылка.Пустая() Тогда
		ЗакрытыйПериод = Константы.ЗакрытыйПериод.Получить();

		Если Объект.Дата <= КонецДня(ЗакрытыйПериод) Тогда
			ТолькоПросмотр = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура КонтрольВводаВЗакрытыйПериодПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	ЗакрытыйПериод = Константы.ЗакрытыйПериод.Получить();

	Если Источник.Дата <= КонецДня(ЗакрытыйПериод) Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Запрещено вводить документы в закрытый период!";
		Сообщение.УстановитьДанные(Источник);
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры