&НаКлиенте
Процедура ПолучитьСтудентов(Команда)
	ПолучитьСтудентовНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗапретИзмененияДокументовВызовСервера.ЗапретитьИзменениеЗакрытогоДокумента(Объект, ТолькоПросмотр);
КонецПроцедуры

&НаСервере
Процедура ПолучитьСтудентовНаСервере()
	Студенты = ПолучениеСтудентовВызовСервера.ПолучитьСтудентовИзРегистра(Группа, Факультет, Курс, Объект.Ссылка,
		ЭтотОбъект);

	Если ЗначениеЗаполнено(Студенты) Тогда
		Объект.Оценки.Загрузить(Студенты);
	КонецЕсли;
КонецПроцедуры