Функция ПолучитьСтрокиСообщенияДниРожденияСегодня() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	(""Сотрудник: "" + Сотрудники.Наименование) КАК СтрокаСообщения
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	МЕСЯЦ(Сотрудники.ДатаРождения) = &Месяц
	|	И ДЕНЬ(Сотрудники.ДатаРождения) = &День
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	(""Студент: "" + Студенты.Наименование)
	|ИЗ
	|	Справочник.Студенты КАК Студенты
	|ГДЕ
	|	МЕСЯЦ(Студенты.ДатаРождения) = &Месяц
	|	И ДЕНЬ(Студенты.ДатаРождения) = &День";

	Запрос.УстановитьПараметр("День", День(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("Месяц", Месяц(ТекущаяДатаСеанса()));

	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаЗначений = РезультатЗапроса.Выгрузить();
	Возврат ТаблицаЗначений.ВыгрузитьКолонку("СтрокаСообщения");
КонецФункции