Функция ФорматироватьНаименование(Наименование, ДелатьНижнийРегистр = Ложь) Экспорт

    // Разделяем строку на слова, удаляя лишние пробелы
	МассивСлов = СтрРазделить(Наименование, " ");

	ФорматированныйМассив = Новый Массив;

	Для Каждого Слово Из МассивСлов Цикл
		// Убираем пробелы и ставим заглавную букву
		Если Не ПустаяСтрока(Слово) Тогда
			ЧастьСтроки = ?(ДелатьНижнийРегистр, НРег(Сред(Слово, 2)), Сред(Слово, 2));
			ФорматированныйМассив.Добавить(ВРег(Лев(Слово, 1)) + ЧастьСтроки);
		КонецЕсли;
	КонецЦикла;

    // Собираем отформатированную строку из слов
	ОтформатированнаяСтрока = СтрСоединить(ФорматированныйМассив, " ");

	Возврат ОтформатированнаяСтрока;

КонецФункции