&НаКлиенте
Процедура ЗакрытьПериод(Команда)
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ДатаЗакрытияБольшеПредыдущейДаты() Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Поле = "ДатаЗакрытия";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Текст = "Текущая дата закрытия меньше или равна предыдущей дате закрытия!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;

	ЗакрытьПериодНаСервере();

	ПоказатьОповещениеПользователя("Период закрыт!");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДатаЗакрытия = Константы.ЗакрытыйПериод.Получить();
КонецПроцедуры

&НаСервере
Процедура ЗакрытьПериодНаСервере()
	Обработки.ЗакрытиеПериода.ЗакрытьПериод(ДатаЗакрытия);
КонецПроцедуры

&НаСервере
Функция ДатаЗакрытияБольшеПредыдущейДаты()
	Если КонецДня(ДатаЗакрытия) > КонецДня(Константы.ЗакрытыйПериод.Получить()) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции